20260824/20260824/Documents/ПриходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриходныйОрдерНаТовары</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СБ_ДвиженияДрагоценныхМеталлов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПриходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаПриемки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладскаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СкладскиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РежимПросмотраПоТоварам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВсегоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроконтролироватьКачество</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаПодтвержденияКачества</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СБ_ДрагоценныеМеталлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДрагоценныеМатериалы</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛигатурныйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧистыйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

20260824/20260824/Documents/ПриходныйОрдерНаТовары/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
&После("ПриСозданииНаСервере")
Процедура ДополнитьУпаковкиПослеСоздания(Отказ, СтандартнаяОбработка)

    ЗаполнитьУпаковкиПоРаспоряжению();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУпаковкиПоРаспоряжению()

    ДокументОбъект = ЭтаФорма.Объект;
    
      Если НЕ ДокументОбъект.Ссылка.Пустая() Тогда
        Возврат;
    КонецЕсли;
    
    Основание = ДокументОбъект.Распоряжение;
    
       Если Основание = Неопределено 
       ИЛИ ТипЗнч(Основание) <> Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов") Тогда
 
        Возврат;
    КонецЕсли;
    
        Распоряжение = Основание.ПолучитьОбъект();
    
    ЗаполнитьТоварыУпаковками(ДокументОбъект, Распоряжение);
	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыУпаковками(ДокументОбъект, Распоряжение)

    Товары = ДокументОбъект.Товары;
    Товары.Очистить();
	
	СтруктураДействий = Новый Структура;
    СтруктураДействий.Вставить("ЗаполнитьВесУпаковки", Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
    СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки", Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
    СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса", Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
    СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема", Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
    СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
    СтруктураДействий.Вставить("ПересчитатьВесОбъем");
	
	
       Для Каждого СтрокаРаспоряжения Из Распоряжение.Товары Цикл
        
            МассивУпаковок = ПолучитьУпаковкиИзСтроки(СтрокаРаспоряжения);
        
        Если МассивУпаковок.Количество() = 0 Тогда
            
            НоваяСтрока = Товары.Добавить();
            НоваяСтрока.Номенклатура = СтрокаРаспоряжения.Номенклатура;
            НоваяСтрока.Количество = СтрокаРаспоряжения.Количество;  
			НоваяСтрока.СтатусУказанияСерий = 5;
            НоваяСтрока.Упаковка = Неопределено;
            НоваяСтрока.КоличествоУпаковок = 0; // или Неопределено    
			ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий);
            Продолжить;
        КонецЕсли;
        
        Для Каждого ДанныеУпаковки Из МассивУпаковок Цикл
            НоваяСтрока = Товары.Добавить();
            НоваяСтрока.Номенклатура = СтрокаРаспоряжения.Номенклатура;
            НоваяСтрока.Упаковка = ДанныеУпаковки.Упаковка;
            НоваяСтрока.КоличествоУпаковок = ДанныеУпаковки.Количество;
            НоваяСтрока.Количество = СтрокаРаспоряжения.Количество; 
			НоваяСтрока.СтатусУказанияСерий = 5;
            ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий);

        КонецЦикла;
        
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий)
	
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено);
         
        
КонецПроцедуры

&НаСервере
Функция ПолучитьУпаковкиИзСтроки(СтрокаРаспоряжения)

    Результат = Новый Массив;
    
        Если ЗначениеЗаполнено(СтрокаРаспоряжения.Упаковка) 
           И СтрокаРаспоряжения.КоличествоУпаковок > 0 Тогда
            СтруктураУпаковки = Новый Структура("Упаковка, Количество");
            СтруктураУпаковки.Упаковка = СтрокаРаспоряжения.Упаковка;
            СтруктураУпаковки.Количество = СтрокаРаспоряжения.КоличествоУпаковок;
            Результат.Добавить(СтруктураУпаковки);
        КонецЕсли;
       
    Возврат Результат;
    
КонецФункции

&НаСервереБезКонтекста
Функция НайтиНоменклатуруПоставщика(Номенклатура, Контрагент)
    Если Номенклатура = Неопределено Или Контрагент = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |   НоменклатураПоставщика.Ссылка КАК Ссылка
        |ИЗ
        |   Справочник.НоменклатураКонтрагентов КАК НоменклатураПоставщика
        |ГДЕ
        |   НоменклатураПоставщика.Номенклатура = &Номенклатура
        |   И НоменклатураПоставщика.ВладелецНоменклатуры = &Контрагент";
    
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
    Запрос.УстановитьПараметр("Контрагент", Контрагент);
    
    Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Выборка = Результат.Выбрать();
    Выборка.Следующий();
    Возврат Выборка.Ссылка;
КонецФункции


&НаСервереБезКонтекста
Функция ОснованиеЭтоЗаказИлиПриобретение(Распоряжение)
    Если Распоряжение = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    
    ТипРаспоряжения = ТипЗнч(Распоряжение);
    Возврат (ТипРаспоряжения = Тип("ДокументСсылка.ЗаказПоставщику")
             Или ТипРаспоряжения = Тип("ДокументСсылка.ПриобретениеТоваровУслуг"));
КонецФункции

&НаКлиенте
&После("ТоварыНоменклатураПриИзменении")
Процедура ТоварыНоменклатураПриИзменении_Расширение(Элемент)
    ЗаполнитьНоменклатуруПоставщикаВСтроке(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
&После("КонтрагентПриИзменении")
Процедура КонтрагентПриИзменении_Расширение(Элемент)
    Для Каждого СтрокаТЧ Из Объект.Товары Цикл
        ЗаполнитьНоменклатуруПоставщикаВСтроке(СтрокаТЧ);
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
&После("ПриОткрытии")
Процедура ПриОткрытии_Расширение(Отказ)
    ОбновитьВидимостьНоменклатурыПоставщика();
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
        ЗаполнитьНоменклатуруПоставщикаВСтроке(СтрокаТЧ);
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоставщикаВСтроке(СтрокаТЧ)
    Если СтрокаТЧ = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    СтрокаТЧ.НоменклатураПоставщика = Неопределено;
    
    Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) 
       Или Не ЗначениеЗаполнено(Объект.Отправитель) Тогда
        Возврат;
    КонецЕсли;
    
    СтрокаТЧ.НоменклатураПоставщика = НайтиНоменклатуруПоставщика(
        СтрокаТЧ.Номенклатура, 
        Объект.Отправитель);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьНоменклатурыПоставщика()
    Распоряжение = Объект.Распоряжение;
    Показывать = ОснованиеЭтоЗаказИлиПриобретение(Распоряжение);
    Элементы.ТоварыНоменклатураПоставщика.Видимость = Показывать;
КонецПроцедуры

#Область ОбработчикиФормы

&НаСервере
Процедура СБ_ПриОткрытииПослеНаСервере() 
	
	СБ_РаботаСДрагоценнымиМеталлами.ЗаполнитьПустуюТаблицуДрагМеталлы(Объект.Товары, Объект.СБ_ДрагоценныеМеталлы); 
	
	//Дерево = РеквизитФормыВЗначение("ДеревоДрагМеталлы");
	ДеревоИзТаблицы = СБ_РаботаСДрагоценнымиМеталлами.ВыгрузитьТаблицуЗначенийВДеревоЗначений(Объект.СБ_ДрагоценныеМеталлы.Выгрузить(), "РодительНоменклатура", "РодительНоменклатура");
	ЗначениеВРеквизитФормы(ДеревоИзТаблицы, "ДеревоДрагМеталлы");
	
	//Если ЗначениеЗаполнено(Объект.Склад) Тогда
	Элементы.ГруппаДрагоценныеМеталлы.Видимость = Истина; //СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Объект.Склад);
	//Иначе
	//	Элементы.ГруппаДрагоценныеМеталлы.Видимость = Ложь; 
	//	Объект.СБ_ДрагоценныеМеталлы.Очистить();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ПриОткрытииПосле(Отказ)
	СБ_ПриОткрытииПослеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиДрагоценныеМеталлы

&НаКлиенте
Процедура СБ_ДеревоДрагМеталлыЛигатурныйВесПриИзмененииПосле(Элемент)
	СБ_ДеревоДрагМеталлыЛигатурныйВесПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СБ_ДеревоДрагМеталлыЛигатурныйВесПриИзмененииПослеНаСервере()
	//ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	//Объект.СБ_ДрагоценныеМеталлы.Очистить();
	//СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры

&НаСервере
Процедура СБ_ДеревоДрагМеталлыЧистыйВесПриИзмененииПослеНаСервере()
	ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	Объект.СБ_ДрагоценныеМеталлы.Очистить();              
	
	ПересчитатьВесаДерева(ДеревоВТаблицу);
	ЗначениеВРеквизитФормы(ДеревоВТаблицу, "ДеревоДрагМеталлы");
	
	СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);
КонецПроцедуры

&НаКлиенте
Процедура СБ_ДеревоДрагМеталлыЧистыйВесПриИзмененииПосле(Элемент) 
	
	СБ_ДеревоДрагМеталлыЧистыйВесПриИзмененииПослеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СБ_СБ_ДрагоценныеМеталлыПЕредУдалениемПослеНаСервере()
	//ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	//Объект.СБ_ДрагоценныеМеталлы.Очистить();
	//СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры

&НаКлиенте
Процедура СБ_ДеревоДрагМеталлыПослеУдаленияПосле(Элемент)
	СБ_СБ_ДрагоценныеМеталлыПЕредУдалениемПослеНаСервере();
КонецПроцедуры             

#КонецОбласти    

#Область ОбработчикиТовары

&НаКлиенте
Процедура СБ_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыСтатусУказанияСерийПриИзмененииПосле(Элемент) 
	
	ПересчитатьКоличество(ТекущийЭлемент.ТекущиеДанные.Номенклатура, ТекущийЭлемент.ТекущиеДанные.Характеристика, ТекущийЭлемент.ТекущиеДанные.Серия, ТекущийЭлемент.ТекущиеДанные.КоличествоУпаковок, Объект.Склад, ТекущийЭлемент.ТекущиеДанные.Упаковка);  
	ПересчитатьТаблицуДрагоценныеМеталлы();               
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)       
	
	
	ПересчитатьКоличество(ТекущийЭлемент.ТекущиеДанные.Номенклатура, ТекущийЭлемент.ТекущиеДанные.Характеристика, ТекущийЭлемент.ТекущиеДанные.Серия, ТекущийЭлемент.ТекущиеДанные.КоличествоУпаковок, Объект.Склад, ТекущийЭлемент.ТекущиеДанные.Упаковка);  
	ПересчитатьТаблицуДрагоценныеМеталлы();
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_СкладПриИзмененииПосле(Элемент)	            
	
	Элементы.ГруппаДрагоценныеМеталлы.Видимость = СкладИспользуетОрдернуюСхему(Объект.Склад);
	
	Если НЕ Элементы.ГруппаДрагоценныеМеталлы.Видимость Тогда
		Объект.СБ_ДрагоценныеМеталлы.Очистить();
	Иначе
		СБ_ПересчитатьДрагМеталлыПослеНаСервере();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СБ_ТоварыСерияПриИзмененииПосле(Элемент)
	ПересчитатьКоличество(ТекущийЭлемент.ТекущиеДанные.Номенклатура, ТекущийЭлемент.ТекущиеДанные.Характеристика, ТекущийЭлемент.ТекущиеДанные.Серия, ТекущийЭлемент.ТекущиеДанные.КоличествоУпаковок, Объект.Склад, ТекущийЭлемент.ТекущиеДанные.Упаковка);  
	ПроверитьСтрокиВДеревеНаСуществованиеНаСервере();
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыСерияОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыСерияОкончаниеВводаТекстаПосле(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти 

#Область Прочее

&НаСервереБезКонтекста
Процедура ПересчитатьВесаДерева(Дерево) Экспорт
	ПересчитатьСуммыСтрок(Дерево.Строки);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПересчитатьСуммыСтрок(Строки)        
	
	Для каждого Строка Из Строки Цикл
		
		Если Строка.Строки.Количество() > 0 Тогда
			//ПересчитатьУзел(Строка.Строки);   
			
			СуммаЧистый = 0;
			СуммаЛигатурный = 0;
			Для каждого Дочерняя Из Строка.Строки Цикл
				СуммаЧистый = СуммаЧистый + Дочерняя.ЧистыйВес;
				//СуммаЛигатурный = СуммаЛигатурный + Дочерняя.ЛигатурныйВес;
			КонецЦикла;
			
			Строка.ЧистыйВес = СуммаЧистый;
			//Строка.ЛигатурныйВес = СуммаЛигатурный;
		КонецЕсли;  
		
	КонецЦикла;       
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьКоличество(Номенклатура, Характеристика, Серия, КоличествоУпаковок, Склад, ЕдиницаИзмерения) Экспорт  
	
	СтруктураТовар =Новый Структура();
	СтруктураТовар.Вставить("Номенклатура", Номенклатура);
	СтруктураТовар.Вставить("Характеристика", Характеристика);
	СтруктураТовар.Вставить("Серия", Серия);
	СтруктураТовар.Вставить("КоличествоУпаковок", КоличествоУпаковок);
	СтруктураТовар.Вставить("Склад", Склад);
	СтруктураТовар.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	Дерево = ПересчитатьСтрокуДеревеПриИзмененииСтрокиТовара(СтруктураТовар, РеквизитФормыВЗначение("ДеревоДрагМеталлы"));
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоДрагМеталлы"); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПересчитатьСтрокуДеревеПриИзмененииСтрокиТовара(СтруктураТовар, Дерево)        
	
	СтрокаНайдена = Ложь;
	Для каждого Строка Из Дерево.Строки Цикл
		
		Если СтруктураТовар.Номенклатура = Строка.Номенклатура И СтруктураТовар.Серия = Строка.Серия И СтруктураТовар.Характеристика = Строка.Характеристика Тогда
			СтрокаНайдена = Истина;	
			Дерево.Строки.Удалить(Строка);
			ДобавитьСтрокуВДерево(СтруктураТовар, Дерево);
			Возврат Дерево;
		КонецЕсли;  
		
	КонецЦикла;
	
	Если Не СтрокаНайдена Тогда
		Возврат ДобавитьСтрокуВДерево(СтруктураТовар, Дерево);	
	КонецЕсли;     
	
	Возврат Дерево;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьСтрокуВДерево(СтруктураЗаполнения, Дерево)        
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДрагоценныеМатериалы.Ссылка КАК НоменклатураРодитель,
	|	НоменклатураДрагоценныеМатериалы.ДрагоценныйМатериал КАК ДрагоценныйМатериал,
	|	НоменклатураДрагоценныеМатериалы.Количество КАК КоличествоДрагоценныйМатериал,
	|	НоменклатураДрагоценныеМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НоменклатураДрагоценныеМатериалы.СБ_ПроцентСодержания КАК СБ_ПроцентСодержания,
	|	НоменклатураДрагоценныеМатериалы.Ссылка.СБ_ИспользоватьПроцентСодержания КАК СБ_ИспользоватьПроцентСодержания,
	|	НоменклатураДрагоценныеМатериалы.Ссылка.ВесЧислитель КАК Вес
	|ИЗ
	|	Справочник.Номенклатура.ДрагоценныеМатериалы КАК НоменклатураДрагоценныеМатериалы
	|ГДЕ
	|	НоменклатураДрагоценныеМатериалы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтруктураЗаполнения.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НоваяСтрокаРодитель = Дерево.Строки.Добавить();
	
	НоваяСтрокаРодитель.Номенклатура = СтруктураЗаполнения.Номенклатура;
	//НоваяСтрока.Номенклатура = Выборка.ДрагоценныйМатериал;
	НоваяСтрокаРодитель.Характеристика = СтруктураЗаполнения.Характеристика;
	НоваяСтрокаРодитель.Количество = СтруктураЗаполнения.КоличествоУпаковок; 
	//НоваяСтрока.Количество = Выборка.КоличествоУпаковок;
	НоваяСтрокаРодитель.ЕдиницаИзмерения = СтруктураЗаполнения.ЕдиницаИзмерения;
	НоваяСтрокаРодитель.Склад = СтруктураЗаполнения.Склад;
	НоваяСтрокаРодитель.Серия = СтруктураЗаполнения.Серия;
	//НоваяСтрокаРодитель.ЛигатурныйВес = Выборка.Вес;
	НоваяСтрокаРодитель.ЧистыйВес = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаРодитель.ЛигатурныйВес = Выборка.Вес;
		
		НоваяСтрока = НоваяСтрокаРодитель.Строки.Добавить();
		
		НоваяСтрока.Номенклатура = Выборка.ДрагоценныйМатериал;
		НоваяСтрока.Характеристика = НоваяСтрокаРодитель.Характеристика;
		//НоваяСтрока.Количество = НоваяСтрокаРодитель.Количество; 
		//НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		//НоваяСтрока.Склад = НоваяСтрокаРодитель.Склад;
		//НоваяСтрока.Серия = НоваяСтрокаРодитель.Серия;
		//НоваяСтрока.ЛигатурныйВес = Выборка.Вес;
		
		Если Выборка.СБ_ИспользоватьПроцентСодержания Тогда
			НоваяСтрока.ЧистыйВес = НоваяСтрокаРодитель.Количество * Выборка.Вес * (Выборка.СБ_ПроцентСодержания / 100);	
		Иначе
			НоваяСтрока.ЧистыйВес = НоваяСтрокаРодитель.Количество * Выборка.КоличествоДрагоценныйМатериал;
		КонецЕсли;
		
		НоваяСтрокаРодитель.ЧистыйВес = НоваяСтрокаРодитель.ЧистыйВес + НоваяСтрока.ЧистыйВес;
		
		
		
		
		
	КонецЦикла;
	
	Возврат Дерево;
	
КонецФункции 

&НаСервере
Процедура ПересчитатьТаблицуДрагоценныеМеталлы()        
	
	ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	Объект.СБ_ДрагоценныеМеталлы.Очистить();
	СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);
	
КонецПроцедуры

&НаСервере
Процедура СБ_ПересчитатьДрагМеталлыПослеНаСервере()      
	
	ОбъектТовары = РеквизитФормыВЗначение("Объект.Товары");
	СБ_РаботаСДрагоценнымиМеталлами.ЗаполнитьПустуюТаблицуДрагМеталлы(ОбъектТовары, Объект.СБ_ДрагоценныеМеталлы, Объект.Склад, Истина); 
	//Элементы.ДеревоДрагМеталлы.Очистить();
	//Дерево = РеквизитФормыВЗначение("ДеревоДрагМеталлы");                                            
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Родитель", "Родитель");
	ДеревоИзТаблицы = СБ_РаботаСДрагоценнымиМеталлами.ВыгрузитьТаблицуЗначенийВДеревоЗначений(Объект.СБ_ДрагоценныеМеталлы.Выгрузить(), "РодительНоменклатура", "РодительНоменклатура");
	
	ЗначениеВРеквизитФормы(ДеревоИзТаблицы, "ДеревоДрагМеталлы");                        
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ПересчитатьДрагМеталлыПосле(Команда)
	СБ_ПересчитатьДрагМеталлыПослеНаСервере();
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОткрытьПодборСерийЗавершение")
Процедура СБ_ОткрытьПодборСерийЗавершение(Результат, ДополнительныеПараметры)
	
	ПараметрыФормыУказанияСерий = ДополнительныеПараметры.ПараметрыФормыУказанияСерий;
    
    
    ЗначениеВозврата = Результат;
    
	Если ЗначениеВозврата <> Неопределено Тогда
		
		#Вставка     
		
		Структура = СБ_ПоискСерии(Результат);
		
		ПересчитатьКоличество(
		ТекущийЭлемент.ТекущиеДанные.Номенклатура, 
		ТекущийЭлемент.ТекущиеДанные.Характеристика, 
		Структура.Серия, 
		?(ЗначениеЗаполнено(Структура.КоличествоУпаковок), Структура.КоличествоУпаковок, ТекущийЭлемент.ТекущиеДанные.КоличествоУпаковок), 
		Объект.Склад, 
		ТекущийЭлемент.ТекущиеДанные.Упаковка); 
		
		ПересчитатьТаблицуДрагоценныеМеталлы(); 
		
		#КонецВставки
		
        ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий);
	КонецЕсли;
	
	#Вставка     
	ПроверитьСтрокиВДеревеНаСуществованиеНаСервере();
	#КонецВставки

КонецПроцедуры  

&НаСервере
Функция СБ_ПоискСерии(АдресВоВременномХранилище)
	
	Результат = Новый Структура;
	Результат.Вставить("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка());
	Результат.Вставить("КоличествоУпаковок", 0);
	
	ТаблицаСерийИКоличества = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Если ТаблицаСерийИКоличества.Количество() > 0 Тогда
		
		СтрокаИзВременногоХранилища = ТаблицаСерийИКоличества.Получить(0);
		
		Результат["Серия"] = СтрокаИзВременногоХранилища.Серия;
		Результат["КоличествоУпаковок"] = СтрокаИзВременногоХранилища.КоличествоУпаковок;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьСтрокиНаСуществование(ТаблицаТовары, ДеревоДрагМеталлы) 
	
	Для Каждого СтрокаДерева Из ДеревоДрагМеталлы.Строки Цикл
		СтрокаНайдена = Ложь;
		Для Каждого СтрокаТЧ Из ТаблицаТовары Цикл
			
			Если СтрокаТЧ.Номенклатура = СтрокаДерева.Номенклатура
				И СтрокаТЧ.Характеристика = СтрокаДерева.Характеристика
				И СтрокаТЧ.Серия = СтрокаДерева.Серия Тогда
				СтрокаНайдена = Истина;	
			КонецЕсли;
			
		КонецЦикла;	
		
		Если Не СтрокаНайдена Тогда
			ДеревоДрагМеталлы.Строки.Удалить(СтрокаДерева);		
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьСтрокиВДеревеНаСуществованиеНаСервере() 
	ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы"); 
	ПроверитьСтрокиНаСуществование(Объект.Товары, ДеревоВТаблицу);
	ЗначениеВРеквизитФормы(ДеревоВТаблицу, "ДеревоДрагМеталлы");
КонецПроцедуры

&НаСервереБезКонтекста
Функция СкладИспользуетОрдернуюСхему(СкладСсылка)	
	Возврат СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(СкладСсылка);	
КонецФункции 
#КонецОбласти
